backend/app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
    def index
        paintings = Painting.all

INSERT INTO "paintings" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "afwewaef"], ["user_id", 1], ["created_at", "2021-02-03 22:23:25.294377"], ["updated_at", "2021-02-03 22:23:25.294377"]]
---
    def create
        painting = Painting.create(:name => params["paintingName"], :user_id => params["userID"], :color_data => params["colorData"])