backend/app/controllers/users_controller.rb

    def create
        users = User.all
        User.create(:username => params[:username])
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "aaa"], ["created_at", "2021-02-04 23:43:21.965657"], ["updated_at", "2021-02-04 23:43:21.965657"]]